tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/hw/r_usb_hreg_access.c
/******************************************************************************
 Function Name   : hw_usb_hset_uact
 Description     : Set UACT-bit (USB Bus Enable) specified port's DVSTCTR0 
                 : register. When Host, to output SOF.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  port   : USB port number
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_uact (usb_utr_t *ptr, uint16_t port)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->DVSTCTR0.WORD |= USB_UACT;
    }
}
/******************************************************************************
 End of function hw_usb_hset_uact
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_uact
 Description     : Clear UACT-bit (USB Bus Enable) specified port's DVSTCTR0 
                 : register. When Host, to prohibit output SOF.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  port   : USB port number
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_uact (usb_utr_t *ptr, uint16_t port)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->DVSTCTR0.WORD &= (~USB_UACT);
    }
}
/******************************************************************************
 End of function hw_usb_hclear_uact
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hwrite_intenb
 Description     : Write the specified data to the specified port's INTENB register.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  port   : USB port number
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_hwrite_intenb (usb_utr_t *ptr, uint16_t port, uint16_t data)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->INTENB1.WORD = data;
    }
}
/******************************************************************************
 End of function hw_usb_hwrite_intenb
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_enb_ovrcre
 Description     : Set specified port's OVRCRE-bit (Overcurrent Input Change Int-
                 : errupt Status Enable) in the INTENB1 register.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  port   : USB port number
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_enb_ovrcre (usb_utr_t *ptr, uint16_t port)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->INTENB1.WORD |= USB_OVRCRE;
    }
}
/******************************************************************************
 End of function hw_usb_hset_enb_ovrcre
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_enb_ovrcre
 Description     : Clear the OVRCRE-bit of the specified port's INTENB1 register,
                 : to prohibit VBUS interrupts.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  port   : USB port number
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_enb_ovrcre (usb_utr_t *ptr, uint16_t port)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->INTENB1.WORD &= (USB_OVRCRE);
    }
}
/******************************************************************************
 End of function hw_usb_hclear_enb_ovrcre
 ******************************************************************************/
 
/******************************************************************************
 Function Name   : hw_usb_hset_enb_bchge
 Description     : The BCHGE-bit (USB Bus Change Interrupt Enable) is set in the 
                 : specified port's INTENB1 register. This will cause a BCHG 
                 : interrupt when a change of USB bus state has been detected.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  port   : USB port number
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_enb_bchge (usb_utr_t *ptr, uint16_t port)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->INTENB1.WORD |= USB_BCHGE;
    }
}
/******************************************************************************
 End of function hw_usb_hset_enb_bchge
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_enb_bchge
 Description     : The BCHGE-bit (USB Bus Change Interrupt Enable) is cleared in 
                 : the specified port's INTENB1 register.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  port   : USB port number
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_enb_bchge (usb_utr_t *ptr, uint16_t port)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->INTENB1.WORD &= (~USB_BCHGE);
    }
}
/******************************************************************************
 End of function hw_usb_hclear_enb_bchge
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_enb_dtche
 Description     : Enable the specified port's DTCHE-interrupt "Disconnection 
                 : Detection" by setting the DTCHE-bit.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  port   : USB port number
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_enb_dtche (usb_utr_t *ptr, uint16_t port)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->INTENB1.WORD |= USB_DTCHE;
    }
}
/******************************************************************************
 End of function hw_usb_hset_enb_dtche
 ******************************************************************************/

