tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/hw/r_usb_hreg_access.c
/******************************************************************************
 Function Name   : hw_usb_hset_usbindx
 Description     : Write the specified 'wIndex', the USB request, to USBINDX
                 : register, for host setup requests for control 
                 : transfers.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_usbindx (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->USBINDX = data;
}
/******************************************************************************
 End of function hw_usb_hset_usbindx
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_usbleng
 Description     : Write the specified 'wLength' value to USBINDX register, 
                 : for host setup requests for control.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_usbleng (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->USBLENG = data;
}
/******************************************************************************
 End of function hw_usb_hset_usbleng
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hwrite_dcpctr
 Description     : Write the specified data value to the DCPCTR register.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_hwrite_dcpctr (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->DCPCTR.WORD = data;
}
/******************************************************************************
 End of function hw_usb_hwrite_dcpctr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_sureq
 Description     : Set te SUREQ-bit in the DCPCTR register 
                 : (Set SETUP packet send when HostController function is selected)
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_sureq (usb_utr_t *ptr)
{
    ptr->ipp->DCPCTR.WORD |= USB_SUREQ;
}
/******************************************************************************
 End of function hw_usb_hset_sureq
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hread_devadd
 Description     : Return the DEVADD register value for the specified USB device 
                 ; address.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  devsel : USB device address value 
 Return value    : DEVADDx content
 ******************************************************************************/
uint16_t hw_usb_hread_devadd (usb_utr_t *ptr, uint16_t devsel)
{
    volatile uint16_t *preg;
    uint16_t devadr;
    uint16_t return_value;

    devadr = devsel >> USB_DEVADDRBIT;

    if (devadr > USB_MAXDEVADDR)
    {
        return USB_ERROR;
    }
    else
    {
        preg = (uint16_t *) &(ptr->ipp->DEVADD0) + devadr;
        return_value = ((*preg) & ((USB_UPPHUB | USB_HUBPORT) | USB_USBSPD));
        return return_value;
    }
}
/******************************************************************************
 End of function hw_usb_hread_devadd
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hrmw_devadd
 Description     : Read-modify-write the specified devsel's DEVADD.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  devsel : USB device address value 
                 : uint16_t  data   : The value to write.
                 : uint16_t  width  : Bit pattern to read-modify-write.
 Return value    : none
 ******************************************************************************/
void hw_usb_hrmw_devadd (usb_utr_t *ptr, uint16_t devsel, uint16_t data, uint16_t width)
{
    volatile uint16_t *preg;
    uint16_t buf;
    uint16_t devadr;

    devadr = devsel >> USB_DEVADDRBIT;

    preg = (uint16_t *) &(ptr->ipp->DEVADD0) + devadr;

    buf = *preg;
    buf &= (~width);
    buf |= (data & width);
    *preg = buf;
}
/******************************************************************************
 End of function hw_usb_hrmw_devadd
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_usbspd
 Description     : Set the DEVADD register's USBSPD for the specified device add-
                 : ress.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
                 : uint16_t  devsel : USB device address value 
                 : uint16_t  data   : The value to write.
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_usbspd (usb_utr_t *ptr, uint16_t devsel, uint8_t data)
{
    volatile uint16_t *preg;
    uint16_t devadr;

    devadr = devsel >> USB_DEVADDRBIT;

    preg = (uint16_t *) &(ptr->ipp->DEVADD0) + devadr;

    (*preg) &= (~USB_USBSPD);
    (*preg) |= data;
}
/******************************************************************************
 End of function hw_usb_hset_usbspd
 ******************************************************************************/

